// 1. Տրված է գնումների ցուցակ՝ List<String>։
// Պետք է իրականացնել հետեւյալ գործողությունները.
// ● ավելացնել նոր ապրանք ցուցակի վերջում,
// ● ավելացնել ապրանք կոնկրետ դիրքում,
// ● հեռացնել ապրանք ըստ ինդեքսի,
// ● փոխարինել կոնկրետ դիրքում գտնվող ապրանքը,
// ● ստանալ ցուցակի առաջին եւ վերջին ապրանքները,
// ● ստուգել՝ արդյոք ցուցակը դատարկ է։
// Վերջում տպել ստացված գնումների ցուցակը։
// Պահանջ: օգտագործել List-ի համապատասխան հատկություններն ու մեթոդները։ Set
// կամ Map օգտագործել չի կարելի։
void main() {
  List<String> cucak = [
    "Հաց",
    "Պանիր",
    "Թթվասեր",
    "Մածուն",
    "Վարունգ"
  ];

  cucak.add("Պոմիդոր");
  cucak.insert(2, "Լավաշ");
  cucak.removeAt(1);
  cucak[3] = "Բիբար";
  print("Առաջին ապրանքը - ${cucak.first}");
  print("Վերջին ապրանքը - ${cucak.last}");
  if (cucak.isEmpty) {
    print("Դատարկ է");
  } else {
    print("Դատարկ չէ");
  }
  print("Ցուցակը - $cucak");
}
